Tester/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApplicationsAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Applications</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Managers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/InformationRegisters/UsersAndGroups/UsersAndGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UsersAndGroups</name>
  <dimensions>
    <name>UserGroup</name>
    <comment>Нельзя использовать имя Group</comment>
    <type>
      <types>CatalogRef.UserGroups</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/Enums/Access/Access.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Access</name>
  <enumValues>
    <name>Undefined</name>
  </enumValues>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Forbid</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Catalogs/Users/ObjectModule.bsl
var CurrentName;
var IsNew;

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( IsFolder ) then
		return;
	endif; 
	checkApplicationsAccess ( CheckedAttributes );
	checkUsers ( CheckedAttributes );
	
EndProcedure

Procedure checkApplicationsAccess ( CheckedAttributes )
	
	if ( ApplicationsAccess = Enums.Access.Allow
		or ApplicationsAccess = Enums.Access.Forbid ) then
		CheckedAttributes.Add ( "Applications" );
	endif; 
	
EndProcedure 

Procedure checkUsers ( CheckedAttributes )
	
	if ( Agent ) then
		CheckedAttributes.Add ( "Users" );
	endif; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel )

	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( IsFolder ) then
		return;
	endif; 
	IsNew = IsNew ();
	getCurrentName ();
	setFullName ();
	if ( DeletionMark ) then
		ExchangePlans.Changes.MarkDeletion ( Ref );
	endif; 
	
EndProcedure

Procedure getCurrentName ()
	
	if ( IsNew ) then
		CurrentName = Description;
	else
		CurrentName = DF.Pick ( Ref, "Description" );
	endif; 
	
EndProcedure 

Procedure setFullName ()
	
	FullName = FirstName + ? ( IsBlankString ( LastName ), "", " " + LastName );
	
EndProcedure 

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( IsFolder ) then
		return;
	endif; 
	SetPrivilegedMode ( true );
	if ( DeletionMark ) then
		LoginsSrv.Remove ( CurrentName );
	else
		makeAccess ();
		makeProfile ();
		if ( IsNew ) then
			ExchangePlans.Changes.EnrollUser ( ThisObject );
		endif; 
	endif;
	if ( LoginsSrv.LastAdministrator () ) then
		Cancel = true;
		return;
	endif; 
	SetPrivilegedMode ( false );
	
EndProcedure

Procedure makeAccess ()
	
	usersGroups = undefined;
	if ( not AdditionalProperties.Property ( "UserGroups", usersGroups ) ) then
		return;
	endif; 
	recordset = InformationRegisters.UsersAndGroups.CreateRecordSet ();
	recordset.Filter.User.Set ( Ref );
	for each row in usersGroups do
		if ( not row.Use ) then
			continue;
		endif; 
		movement = recordset.Add ();
		movement.UserGroup = row.UserGroup;
		movement.User = Ref;
	enddo; 
	recordset.Write ();
	
EndProcedure 

Procedure makeProfile ()
	
	user = getIBUser ();
	setProfile ( user );
	LoginsSrv.SetRights ( user );
	user.Write ();
	
EndProcedure 

Function getIBUser ()
	
	user = InfoBaseUsers.FindByName ( CurrentName );
	if ( user = undefined ) then
		user = InfoBaseUsers.CreateUser ();
	endif;
	return user;
	
EndFunction

Procedure setProfile ( User )
	
	User.Name = Description;
	User.FullName = FullName;
	User.Language = Metadata.Languages.Find ( Language );
	password = undefined;
	if ( AdditionalProperties.Property ( "Password", password ) ) then
		User.Password = password;
	endif; 
	
EndProcedure
